modm-ext/archive-stmicro-svd/header_stm32h747xx.svd
      <register>
        <name>HUFFENC_AC0.72</name>
        <addressOffset>0x620</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.73</name>
        <addressOffset>0x624</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.74</name>
        <addressOffset>0x628</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.75</name>
        <addressOffset>0x62c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.76</name>
        <addressOffset>0x630</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.77</name>
        <addressOffset>0x634</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.78</name>
        <addressOffset>0x638</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.79</name>
        <addressOffset>0x63c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.80</name>
        <addressOffset>0x640</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.81</name>
        <addressOffset>0x644</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.82</name>
        <addressOffset>0x648</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.83</name>
        <addressOffset>0x64c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.84</name>
        <addressOffset>0x650</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.85</name>
        <addressOffset>0x654</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.86</name>
        <addressOffset>0x658</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.87</name>
        <addressOffset>0x65c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.0</name>
        <addressOffset>0x660</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.1</name>
        <addressOffset>0x664</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.2</name>
        <addressOffset>0x668</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.3</name>
        <addressOffset>0x66c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.4</name>
        <addressOffset>0x670</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.5</name>
        <addressOffset>0x674</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.6</name>
        <addressOffset>0x678</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.7</name>
        <addressOffset>0x67c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.8</name>
        <addressOffset>0x680</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.9</name>
        <addressOffset>0x684</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.10</name>
        <addressOffset>0x688</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.11</name>
        <addressOffset>0x68c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.12</name>
        <addressOffset>0x690</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.13</name>
        <addressOffset>0x694</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.14</name>
        <addressOffset>0x698</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.15</name>
        <addressOffset>0x69c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.16</name>
        <addressOffset>0x6a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.17</name>
        <addressOffset>0x6a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.18</name>
        <addressOffset>0x6a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.19</name>
        <addressOffset>0x6ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.20</name>
        <addressOffset>0x6b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.21</name>
        <addressOffset>0x6b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.22</name>
        <addressOffset>0x6b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.23</name>
        <addressOffset>0x6bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.24</name>
        <addressOffset>0x6c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.25</name>
        <addressOffset>0x6c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.26</name>
        <addressOffset>0x6c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.27</name>
        <addressOffset>0x6cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.28</name>
        <addressOffset>0x6d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.29</name>
        <addressOffset>0x6d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.30</name>
        <addressOffset>0x6d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.31</name>
        <addressOffset>0x6dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.32</name>
        <addressOffset>0x6e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.33</name>
        <addressOffset>0x6e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.34</name>
        <addressOffset>0x6e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.35</name>
        <addressOffset>0x6ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.36</name>
        <addressOffset>0x6f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.37</name>
        <addressOffset>0x6f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.38</name>
        <addressOffset>0x6f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.39</name>
        <addressOffset>0x6fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.40</name>
        <addressOffset>0x700</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.41</name>
        <addressOffset>0x704</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.42</name>
        <addressOffset>0x708</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.43</name>
        <addressOffset>0x70c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.44</name>
        <addressOffset>0x710</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.45</name>
        <addressOffset>0x714</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.46</name>
        <addressOffset>0x718</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.47</name>
        <addressOffset>0x71c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.48</name>
        <addressOffset>0x720</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.49</name>
        <addressOffset>0x724</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.50</name>
        <addressOffset>0x728</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.51</name>
        <addressOffset>0x72c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.52</name>
        <addressOffset>0x730</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.53</name>
        <addressOffset>0x734</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.54</name>
        <addressOffset>0x738</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.55</name>
        <addressOffset>0x73c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.56</name>
        <addressOffset>0x740</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.57</name>
        <addressOffset>0x744</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.58</name>
        <addressOffset>0x748</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.59</name>
        <addressOffset>0x74c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.60</name>
        <addressOffset>0x750</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.61</name>
        <addressOffset>0x754</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.62</name>
        <addressOffset>0x758</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.63</name>
        <addressOffset>0x75c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.64</name>
        <addressOffset>0x760</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.65</name>
        <addressOffset>0x764</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.66</name>
        <addressOffset>0x768</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.67</name>
        <addressOffset>0x76c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.68</name>
        <addressOffset>0x770</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.69</name>
        <addressOffset>0x774</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.70</name>
        <addressOffset>0x778</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.71</name>
        <addressOffset>0x77c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.72</name>
        <addressOffset>0x780</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.73</name>
        <addressOffset>0x784</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.74</name>
        <addressOffset>0x788</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.75</name>
        <addressOffset>0x78c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.76</name>
        <addressOffset>0x790</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.77</name>
        <addressOffset>0x794</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.78</name>
        <addressOffset>0x798</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.79</name>
        <addressOffset>0x79c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.80</name>
        <addressOffset>0x7a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.81</name>
        <addressOffset>0x7a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.82</name>
        <addressOffset>0x7a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.83</name>
        <addressOffset>0x7ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.84</name>
        <addressOffset>0x7b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.85</name>
        <addressOffset>0x7b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.86</name>
        <addressOffset>0x7b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.87</name>
        <addressOffset>0x7bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.0</name>
        <addressOffset>0x7c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.1</name>
        <addressOffset>0x7c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.2</name>
        <addressOffset>0x7c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.3</name>
        <addressOffset>0x7cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.4</name>
        <addressOffset>0x7d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.5</name>
        <addressOffset>0x7d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.6</name>
        <addressOffset>0x7d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.7</name>
        <addressOffset>0x7dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.0</name>
        <addressOffset>0x7e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.1</name>
        <addressOffset>0x7e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.2</name>
        <addressOffset>0x7e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.3</name>
        <addressOffset>0x7ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.4</name>
        <addressOffset>0x7f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.5</name>
        <addressOffset>0x7f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.6</name>
        <addressOffset>0x7f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC1.7</name>
        <addressOffset>0x7fc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FMC_Bank1_R</name>
      <baseAddress>0x52004000</baseAddress>
      <register>
        <name>BTCR.0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.3</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.4</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.5</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.6</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BTCR.7</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FMC_Bank2_R</name>
      <baseAddress>0x52004060</baseAddress>
      <register>
        <name>PCR2</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SR2</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PMEM2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PATT2</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ECCR2</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FMC_Bank3_R</name>
      <baseAddress>0x52004080</baseAddress>
      <register>
        <name>PCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PWAITEN</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PBKEN</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PWID</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>ECCEN</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TAR</name>
          <bitOffset>13</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ECCPS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>SR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IRS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ILS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IFS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IREN</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ILEN</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IFEN</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FEMPT</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>PMEM</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MEMSET</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>MEMWAIT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>MEMHOLD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>MEMHIZ</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>PATT</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ATTSET</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ATTWAIT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ATTHOLD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ATTHIZ</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>ECCR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FMC_Bank1E_R</name>
      <baseAddress>0x52004104</baseAddress>
      <register>
        <name>BWTR.0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADDSET</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ADDHLD</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATAST</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>BUSTURN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ACCMOD</name>
          <bitOffset>28</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>BWTR.1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
