modm-ext/archive-stmicro-svd/header_stm32h747xx.svd
      <fields>
        <field>
          <name>DMNGT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>RES</name>
          <bitOffset>2</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>EXTSEL</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>EXTEN</name>
          <bitOffset>10</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>OVRMOD</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CONT</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AUTDLY</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DISCEN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DISCNUM</name>
          <bitOffset>17</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>JDISCEN</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JQM</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD1SGL</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD1EN</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JAWD1EN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JAUTO</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD1CH</name>
          <bitOffset>26</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JQDIS</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CFGR2</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ROVSE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JOVSE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OVSS</name>
          <bitOffset>5</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TROVS</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROVSM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSHIFT1</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSHIFT2</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSHIFT3</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSHIFT4</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OVSR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>LSHIFT</name>
          <bitOffset>28</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMPR1</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SMP0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP1</name>
          <bitOffset>3</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP2</name>
          <bitOffset>6</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP3</name>
          <bitOffset>9</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP4</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP5</name>
          <bitOffset>15</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP6</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP7</name>
          <bitOffset>21</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP8</name>
          <bitOffset>24</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP9</name>
          <bitOffset>27</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMPR2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SMP10</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP11</name>
          <bitOffset>3</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP12</name>
          <bitOffset>6</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP13</name>
          <bitOffset>9</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP14</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP15</name>
          <bitOffset>15</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP16</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP17</name>
          <bitOffset>21</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP18</name>
          <bitOffset>24</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SMP19</name>
          <bitOffset>27</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>PCSEL</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PCSEL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>LTR1</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HTR1</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SQR1</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>L</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>SQ1</name>
          <bitOffset>6</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ2</name>
          <bitOffset>12</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ3</name>
          <bitOffset>18</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ4</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR2</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ5</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ6</name>
          <bitOffset>6</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ7</name>
          <bitOffset>12</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ8</name>
          <bitOffset>18</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ9</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR3</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ10</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ11</name>
          <bitOffset>6</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ12</name>
          <bitOffset>12</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ13</name>
          <bitOffset>18</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ14</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR4</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ15</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ16</name>
          <bitOffset>6</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>JSQR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>JEXTSEL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JEXTEN</name>
          <bitOffset>7</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>JSQ1</name>
          <bitOffset>9</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ2</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ3</name>
          <bitOffset>21</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ4</name>
          <bitOffset>27</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>OFR1</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OFFSET1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>26</bitWidth>
        </field>
        <field>
          <name>OFFSET1_CH</name>
          <bitOffset>26</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SSATE</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>OFR2</name>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OFFSET2</name>
          <bitOffset>0</bitOffset>
          <bitWidth>26</bitWidth>
        </field>
        <field>
          <name>OFFSET2_CH</name>
          <bitOffset>26</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SSATE</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>OFR3</name>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OFFSET3</name>
          <bitOffset>0</bitOffset>
          <bitWidth>26</bitWidth>
        </field>
        <field>
          <name>OFFSET3_CH</name>
          <bitOffset>26</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SSATE</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>OFR4</name>
        <addressOffset>0x6c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OFFSET4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>26</bitWidth>
        </field>
        <field>
          <name>OFFSET4_CH</name>
          <bitOffset>26</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SSATE</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR1</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR2</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR3</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR4</name>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>AWD2CR</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AWD2CH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>AWD3CR</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AWD3CH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>LTR2</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HTR2</name>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LTR3</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HTR3</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DIFSEL</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DIFSEL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>CALFACT</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CALFACT_S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>CALFACT_D</name>
          <bitOffset>16</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>CALFACT2</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LINCALFACT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>30</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>ADC3_COMMON</name>
      <baseAddress>0x58026300</baseAddress>
      <register>
        <name>CSR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADRDY_MST</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOSMP_MST</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOC_MST</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOS_MST</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OVR_MST</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOC_MST</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOS_MST</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD1_MST</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD2_MST</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD3_MST</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JQOVF_MST</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADRDY_SLV</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOSMP_SLV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOC_SLV</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOS_SLV</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OVR_SLV</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOC_SLV</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOS_SLV</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD1_SLV</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD2_SLV</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWD3_SLV</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JQOVF_SLV</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DUAL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>DELAY</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DAMDF</name>
          <bitOffset>14</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>CKMODE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PRESC</name>
          <bitOffset>18</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>VREFEN</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSEN</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VBATEN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CDR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RDATA_MST</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>RDATA_SLV</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CDR2</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RDATA_ALT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>HSEM</name>
      <baseAddress>0x58026400</baseAddress>
      <register>
        <name>R.0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PROCID</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>COREID</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>R.1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PROCID</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>COREID</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>R.2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
